using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.UI;
using System.Web.UI.WebControls;

namespace AllPower.WEB.SysAdmin.Model
{
    public partial class Timeaxis_Detail : System.Web.UI.Page
    {
        public string str = "";
        protected void Page_Load(object sender, EventArgs e)
        {
           string id= Request["id"].ToString();
           switch (id)
           {
               case "1": str = "<div><img alt='#' src='../images/huawei1.jpg' /></div><div><p>&nbsp;&nbsp;&nbsp;华为技术有限公司是一家生产销售通信设备的民营通信科技公司，总部位于中国广东省深圳市龙岗区坂田华为基地。华为的产品主要涉及通信网络中的交换网络、传输网络、无线及有线固定接入网络和数据通信网络及无线终端产品，为世界各地通信运营商及专业网络拥有者提供硬件设备、软件、服务和解决方案。华为于1987年在中国深圳正式注册成立。现任总裁为任正非，董事长为孙亚芳。</p><p>&nbsp;&nbsp;&nbsp;华为总部办公楼2007年合同销售额160亿美元，其中海外销售额115亿美元，并且是当年中国国内电子行业营利和纳税第一。截至到2008年底，华为在国际市场上覆盖100多个国家和地区，全球排名前50名的电信运营商中，已有45家使用华为的产品和服务。华为的产品和解决方案已经应用于全球150多个国家，服务全球运营商50强中的45家及全球1/3的人口。</p><p>2013年《财富》世界500强中华为排行全球第315位，与上年相比上升三十六位。企业规模:2012年华为发布可持续发展报告。报告显示，华为员工人数逐年增长，到2011年已超过15万人，海外员工比例也在上升。为了对员工进行保障，华为同年投入达58.1亿。2012年华为在经济、环境、社会方面的实践与绩效：华为员工人数在2010至2012年呈逐年增加的态势，截至,华为LOGO,2012年底该公司共拥有来自156个国家和地区的超过15万名员工，其中研发人员占总员工人数的45.36%，外籍员工人数接近3万。与2011年相比，2012年华为中国员工的人数占总员工人数的百分比降低了7.72%至72.09%，海外员工本地化比例正逐年上升，2012年从2010年的69%、2011年的72%增至73%。同时，2012年华为海外中高层管理人员本地化比例达22%，全部管理岗位管理者本地化比例达29%。报告还显示，华为2012年全球员工保障投入达人民币58.1亿元。</p><p>据悉，这笔支出主要用于为华为全球员工购买各国家和地区法律规定的各类保险，为员工提供人身意外伤害险、重大疾病险、寿险、医疗险及商务旅行险等商业保险福利，并设置了特殊情况下的公司医疗救助计划。此外，为了应对员工在全球多个国家可能遇到的突发事件，华为建立起突发事件应急处理的相关流程及常设组织，在突发事件发生后第一时间启动应急流程，最大限度减少突发事件对员工的危害。去年底，华为就曾包机救助安哥拉代表处一位重病员工。</p></div>"; break;
               case "2": str = "<div><p>&nbsp;&nbsp;&nbsp;蛟河市于氏木业有限公司位于新站镇毓文路57号，该公司是集成材、家具加工制造业为一体的现代化企业。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;成立于2002年9月，总投资达2000多万元，其中固定投资1390万元，占地面积3万多平方米，管理人员20余人，技术人员6人，员工300余人，拥有一个总公司、三个集成材分厂和一个家俱制造厂。厂房总面积达7000平方米，生产的集成材以长白山原木为原料，锯材、烘干、刨光、指接、拼板、刹光已经达到国际先进水平，是国内外加工制造高档家俱的最佳板材原料，产品运销到日本，年创汇50多万美元。公司制造的实木家俱按中高档分为会议系列、办公系列、民用系列、宾馆系列、酒店系列、实木门系列等6个系列，200多个品种，年生产5万多件家俱。总产值达到1500万元。于氏木业有限公司视产品质量为企业生命，坚持“以质量求生存，以创新求发展，以信誉为品德”的经营理念，事业蒸蒸日上，不断发展。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2003年，公司又新建厂房近1000平方米，目前正在施工，总投资50万元。而且又招商引资一家珲春实木家俱厂，总投资500万元，在铁路西新建一个占地9000平方米的家俱厂，现已筹建，预计在2004年初上马投入生产，产品有订单远销到南韩。</p></div>"; break;
               case "3": str = "<div><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;美的集团（SZ.000333）是一家以家电制造业为主的大型综合性企业集团，于2013年9月18日在深交所上市，拥有美的、小天鹅、威灵、华凌、安得、美芝等十余个品牌。在全国各地设有强大的营销网络，并在海外各主要市场设有近30个分支机构。创业于1968年的美的集团，是一家以家电业为主，涉足照明电器、房地产、物流等领域的大型综合性现代化企业集团，旗下拥有四大产业集团，是中国最具规模的白色家电生产基地和出口基地之一。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;美的(2张)1980年，美的正式进入家电业；1981年开始使用美的品牌。据尚蛙会员联盟调查显示，美的集团员工13万人，旗下拥有美的、小天鹅、威灵、华凌等十余个品牌。除顺德总部外，美的集团还在国内的广州，中山，重庆，安徽合肥及芜湖，湖北武汉及荆州，江苏无锡、淮安及苏州，山西临汾，河北邯郸等地建有生产基地；并在越南、白俄罗斯建有生产基地。</p><p>美的集团在全国各地设有强大的营销网络，并在海外各主要市场设有超过30个分支机构。</p></div>"; break;
               case "4": str = "<div><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;万联证券有限责任公司是由实力雄厚的国有资产经营公司和投资公司出资组建的全资国有企业，于2001年8月23日经中国证监会证监机构字 2001148号文批准设立，公司注册资本11.5亿元人民币，注册地为广州市，设立时名称为“万联证券经纪有限责任公司”，属经纪类证券公司。2002年11月29日，经中国证监会证监机构字2002353号文批复，同意公司业务范围比照综合类证券公司执行，公司名称变更为“万联证券有限责任公司”。</p></div>"; break;
               case "5": str = "<div><p>从科学社会学的角度看，科学普及是一种广泛的社会现象，必然有其自身的“增长点”。科学普及的生长点就在自然与人、科学与社会的交叉点上。也就是说，自然科学与人类社会的相互作用生成了科学普及，科技与社会又作为科学普及的“土壤”，哺育着它的生长。而科技进步和社会发展，则为科学普及不断提供新的生长点，使科普工作具有鲜活的生命力和浓厚的社会性、时代性。形象地说，科学普及是以时代为背景，以社会为舞台，以人为主角，以科技为内容，面向广大公众的一台“现代文明戏”，在这个舞台上是没有传统保留节目的。</p><p>从本质上说，科学普及是一种社会教育。作为社会教育它既不同于学校教育，也不同于职业教育，其基本特点是：社会性、群众性和持续性。科学普及的特点表明，科普工作必须运用社会化、群众化和经常化的科普方式，充分利用现代社会的多种流通渠道和信息传播媒体，不失时机地广泛渗透到各种社会活动之中，才能形成规模宏大、富有生机、社会化的大科普。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;现代科学技术是一个极其庞大而复杂的立体结构体系，具有丰富的内涵和多种社会职能。在科普工作中，既要注重科技知识的外在功利，又不可忽视其内在的科学思想、科学方法和科学精神。在知识信息中含有的四个不同层次（即数据、信息、知识和智能）中，占据最高层次的智能，才是构成人们科学文化素质的最具活性的重要素质。而这对身处不同岗位的各级领导干部和科技工作管理者来说，尤为重要。[1]”。</p></div>"; break;
           }
        }
    }
}